<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>Insert title here</title>
</head>
<body>
	<h3>산술연산자(+,-,*,/(div),%(mod))</h3>
	&#36{10+20}=${10+20}<br>
	&#36{"10"+"20"}=${"10"+"20"}<br>
	&#36{10/3}=${10/3}<br>
<%-- 	&#36{10 div 20}=${10 div 3}<br> --%>
	&#36{10%3}=${10%3}<br>
	&#36{10 mod 3}=${10 mod 3}<br>
	<h3>비교연산자(==(eq),!=(ne), <(lt), >(gt), <=(le), >=(ge) => true/false)</h3>
	&#36{100==200}=${100==200}<br>
	&#36{100 eq 200}=${100 eq 200}<br>
	&#36{100!=200}=${100!=200}<br>
<%-- 	&#36{100 ne 200}=${100 ne 200}<br> --%>
	&#36{100<200}=${100<200}<br>
	&#36{100 lt 200}=${100 lt 200}<br>
	&#36{100>200}=${100>200}<br>
	&#36{100 gt 200}=${100 gt 200}<br>
	&#36{100<=200}=${100<=200}<br>
	&#36{100 le 200}=${100 le 200}<br>
	&#36{100>=200}=${100>=200}<br>
	&#36{100 ge 200}=${100 ge 200}<br>
</body>
</html>